Unable to replicate the problem, this could be a transient issue.

```

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # awscc_elasticache_serverless_cache.ec-svrls will be created
  + resource "awscc_elasticache_serverless_cache" "ec-svrls" {
      + arn                      = (known after apply)
      + cache_usage_limits       = (known after apply)
      + create_time              = (known after apply)
      + daily_snapshot_time      = (known after apply)
      + description              = (known after apply)
      + endpoint                 = (known after apply)
      + engine                   = "Redis"
      + final_snapshot_name      = (known after apply)
      + full_engine_version      = (known after apply)
      + id                       = (known after apply)
      + kms_key_id               = (known after apply)
      + major_engine_version     = (known after apply)
      + reader_endpoint          = (known after apply)
      + security_group_ids       = (known after apply)
      + serverless_cache_name    = "test"
      + snapshot_arns_to_restore = (known after apply)
      + snapshot_retention_limit = (known after apply)
      + status                   = (known after apply)
      + subnet_ids               = (known after apply)
      + tags                     = (known after apply)
      + user_group_id            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
awscc_elasticache_serverless_cache.ec-svrls: Creating...
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [10s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [20s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [30s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [40s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [50s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [1m0s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [1m10s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [1m20s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [1m30s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [1m40s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [1m50s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [2m0s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [2m10s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [2m20s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [2m31s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [2m41s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Still creating... [2m51s elapsed]
awscc_elasticache_serverless_cache.ec-svrls: Creation complete after 2m54s [id=test]
```

@kenroyandfamily can you please try it again and let us know if issue persisted ?